In [1]:
ls

Applications/   Documents/      Library/        Music/          Public/
Desktop/        Downloads/      Movies/         Pictures/       Untitled.ipynb

In [2]:
cd ~/Documents

/Users/keenanburkepitts/Documents

In [3]:
ls

Data_Science/          My Tableau Repository/ Personal/

In [4]:
cd Data_Science/Udacity_DAND/

/Users/keenanburkepitts/Documents/Data_Science/Udacity_DAND

In [5]:
ls

Titanic_datacleaning.ipynb
asylum-seekers-monthly-2016-12-08-152150.csv
global-superstore.xlsx
movie-metadata.csv
titanic-data.csv
world-cup-data.xlsx

In [6]:
import pandas as pd

In [38]:
titanic_raw = pd.read_csv('titanic-data.csv')

In [39]:
titanic_raw.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [40]:
#finding all columns with null values
null_columns=titanic_raw.columns[titanic_raw.isnull().any()]
titanic_raw[null_columns].isnull().sum()

Age         177
Cabin       687
Embarked      2
dtype: int64

In [41]:
len(titanic_raw[titanic_raw.isnull().any(axis=1)][null_columns])

708

In [42]:
titanic_clean = titanic_raw.drop(['Cabin'], axis=1)

In [43]:
titanic_clean.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [45]:
titanic_clean[titanic_clean.Embarked.isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,NaN

In [47]:
titanic_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.6+ KB

In [48]:
titanic_clean['Embarked'] = titanic_clean['Embarked'].astype('category')

In [49]:
titanic_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Embarked       889 non-null category
dtypes: category(1), float64(2), int64(5), object(3)
memory usage: 70.7+ KB

In [50]:
pwd

'/Users/keenanburkepitts/Documents/Data_Science/Udacity_DAND'